In [2]:
import numpy as np
import pandas as pd

In [ ]:
a = pd.DataFrame(np.random.randint(0, 100, size=(10, 4)), columns=list(
    'ABCD'))  # dataframe is a 2D array with labeled axes
print(a)

In [ ]:
# create custom indices for elemnts similar to dictionary  seies is a 1D array with labeled axes
s = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9], index=[
              'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'])
print(s, '\n')
print(s['a'])  # print 1st element'

In [ ]:
a = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=np.int64)
print(s.values is a)
pd.set_option('display.max_columns', None)  # display all columns

In [ ]:
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7, 'h': 8, 'i': 9}
# dictionaies can be passed to series similar to list in numpy
d = pd.Series(d)
print(d)
# read csv file as dataframe
dr = pd.read_csv('ref_pandas by keith/pokemon_data.csv')

dr.head(3)  # print first 3 rows

In [ ]:
dr.tail(3)  # print last 3 rows

In [ ]:
dr.shape  # print shape of dataframe (attributes not methods)

In [ ]:
dr.info()  # print info about dataframe
# objects are usually strings

In [ ]:
d2 = pd.DataFrame(dr)  # create a copy of dataframe
# wrap text in dataframe
pd.set_option('display.max_colwidth', None)  # display all columns
d2.head(3)  # print first 3 rows

In [ ]:
# import data from excel
d3 = pd.read_excel('ref_pandas by keith/pokemon_data.xlsx',
                   sheet_name='pokemon_data')
d3.head()

In [ ]:
# in normal pytthon
di = {"name": [1, 2, 3, 4, 5, 6, 7, 8, 9], "age": [1, 2, 3, 4, 5, 6, 7, 8, 9]}
print(di)

di = pd.DataFrame(di)
di.head()

In [ ]:
print(dr['Name'][0:5])  # print first 5 rows of name column

In [ ]:
dr[['Name', 'Type 1', 'HP']]  # print multiple columns

In [ ]:
# integer location
dr.iloc[0]  # print first rows

In [ ]:
dr.iloc[[0, 1, 2], [0, 1, 2]]  # print first 3 rows and first 3 columns

In [ ]:
# label location
# print first 3 rows and first 3 columns #slicing is inclusive and doesnt need brackets
dr.loc[0:3, 'NAME':'HP']

In [ ]:
dr.HP.value_counts()  # count number of occurences of each value in a column

In [ ]:
din = dr.head(5)
din.set_index('#')  # set index of dataframe

In [ ]:
din  # remains unchanged

In [ ]:
din.set_index('Name', inplace=True)  # set index of dataframe permanently
din

In [ ]:
din.reset_index(inplace=True)  # reset index of dataframe permanently
din

In [ ]:
# set index of dataframe while reading
dr2 = pd.read_csv('ref_pandas by keith/pokemon_data.csv', index_col='#')
dr2.head()

In [ ]:
dr2.sort_index(ascending=True, inplace=True)  # sort dataframe by index

In [ ]:
# filtering
dr3 = dr2['HP'] == 70  # filter by column
dr3

In [ ]:
dr2[dr3]  # print filtered dataframe  can aslo be written as dr2[dr2['HP']==70]

In [ ]:
# filter by multiple conditions
dr2[(dr2['HP'] == 70) & (dr2['Type 1'] == 'Fire')]

In [ ]:
dr[dr['NAME'].str.contains('Mega')]  # filter by string using string methods

In [ ]:
dr.columns = [x.upper() for x in dr.columns]  # convert column names to uppercase
dr

In [ ]:
dr.columns = dr.columns.str.replace(' ', '_')  # replace spaces with underscore

In [ ]:
dr2.rename(columns={'HP': 'HP2'}, inplace=True)  # rename column

In [ ]:
dr2

In [ ]:
dr2.loc[30, ['Name']]= 'Nidorina_'  # change value of a cell
dr2

In [ ]:
dr2.at[30,'Name'] = 'Nidorina'  # change value of a cell

In [ ]:
print(len(dr2.at[30,'NAME']))  # print length of string
#or
dr2['Name'].apply(len)  # apply function to each element of a column          apply is a method of series to apply a function to each element of a series

In [ ]:
dr2['Name']=dr2['Name'].apply(lambda x: x.upper())  # apply lambda function to each element of a column
dr2

In [ ]:
dr2.apply(len)    #will not work on dataframe rather print length of each column

In [ ]:
drname=dr2[['Name','Name']]  # apply function to each element of a dataframe
drname.applymap(len)  # applymap is a method of dataframe to apply a function to each element of a dataframe

In [ ]:
drname

In [ ]:
drname.columns = ['Name1','Name2']  # rename columns

In [ ]:
drname['Name1'].map({'BULBASAUR':'no'})  #change values of a column based on a dictionary but changes rest of the values to NaN

In [ ]:
drname.Name2.replace({'BULBASAUR':'no'}) #only changes values of specified keys

In [66]:
df= {'first':[1,2,3,4,5,6,7,8,9],'second':[1,2,3,4,5,6,7,8,9],'last':['one n','two w','three 2','four w','five 4','six g','seven f','eight 3','nine ss']}
df=pd.DataFrame(df)
df

   first  second     last
0      1       1    one n
1      2       2    two w
2      3       3  three 2
3      4       4   four w
4      5       5   five 4
5      6       6    six g
6      7       7  seven f
7      8       8  eight 3
8      9       9  nine ss

In [67]:
df['added']=df['first']+df['second']  #add values in 2 columns
df

   first  second     last  added
0      1       1    one n      2
1      2       2    two w      4
2      3       3  three 2      6
3      4       4   four w      8
4      5       5   five 4     10
5      6       6    six g     12
6      7       7  seven f     14
7      8       8  eight 3     16
8      9       9  nine ss     18

In [68]:
df=df.drop(columns=['added'])  #drop a column   inplace removes whole dataframe???   to remove a row use drop(index=0)

In [69]:
df

   first  second     last
0      1       1    one n
1      2       2    two w
2      3       3  three 2
3      4       4   four w
4      5       5   five 4
5      6       6    six g
6      7       7  seven f
7      8       8  eight 3
8      9       9  nine ss

In [70]:
df['last'].str.split(' ',expand=True)  #split a column into multiple columns

       0   1
0    one   n
1    two   w
2  three   2
3   four   w
4   five   4
5    six   g
6  seven   f
7  eight   3
8   nine  ss

In [71]:
df[['new1','new2']]=df['last'].str.split(' ',expand=True)  #split a column into multiple columns and add to dataframe

In [72]:
df

   first  second     last   new1 new2
0      1       1    one n    one    n
1      2       2    two w    two    w
2      3       3  three 2  three    2
3      4       4   four w   four    w
4      5       5   five 4   five    4
5      6       6    six g    six    g
6      7       7  seven f  seven    f
7      8       8  eight 3  eight    3
8      9       9  nine ss   nine   ss

In [73]:
df.append({'first':10,'second':10,'last':'ten 10'},ignore_index=True)  #add a row to dataframe

C:\Users\Haroon\AppData\Local\Temp\ipykernel_14192\4078804114.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':10,'second':10,'last':'ten 10'},ignore_index=True)  #add a row to dataframe

   first  second     last   new1 new2
0      1       1    one n    one    n
1      2       2    two w    two    w
2      3       3  three 2  three    2
3      4       4   four w   four    w
4      5       5   five 4   five    4
5      6       6    six g    six    g
6      7       7  seven f  seven    f
7      8       8  eight 3  eight    3
8      9       9  nine ss   nine   ss
9     10      10   ten 10    NaN  NaN

In [74]:
#df.append(df2,ignore_index=True,sort=False)  #add a dataframe to another dataframe

In [80]:
df.drop(index = df[df['first'] == 10].index) #drop a row based on a condition'

   first  second     last   new1 new2
0      1       1    one n    one    n
1      2       2    two w    two    w
2      3       3  three 2  three    2
3      4       4   four w   four    w
4      5       5   five 4   five    4
5      6       6    six g    six    g
6      7       7  seven f  seven    f
7      8       8  eight 3  eight    3
8      9       9  nine ss   nine   ss